InformationRegisters/ВариантыАлгоритмовРасчетаЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВариантыАлгоритмовРасчетаЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасчетНДФЛ17</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАлгоритмовРасчетНДФЛ17</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВводаСчета378</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчитыватьНДСДляПочтовогоСбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетИндексацииПропорционально</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАлгоритмовРасчетИндексацииПропорционально</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорогИндексации103</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАлгоритмовПорогИндексации103</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачисленияДляПредварительногоРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НачисленияДляПредварительногоРасчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьИзРегистров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПредставленияФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПредставленияФизЛиц</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фамилия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФамилияИмя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФамилияИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФамилияИмяОтчество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФамилияИО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КатегорииРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>КатегорииРасчетов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичное</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеПервогоУровня</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеВторогоУровня</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеТретьегоУровня</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРасчетаОплатыТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаОплатыТруда</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаВечерниеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыПроцентомДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыФиксСуммой</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыФиксСуммойДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Взносы</Name>
					<Comment>Взносы, которые перечисляются работниками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносыФОТ</Name>
					<Comment>Взносы, которые перечисляет организация на ФОТ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыслугаЛет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосударственноеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлиментыПроцентом</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаНочныеЧасы</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовыйСбор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Замена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндексацияЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндексацияСоциальныхНачислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнителныйЛистСУчетомОграничения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентом</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистПроцентомДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистФиксСуммой</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныйЛистФиксСуммойДоПредела</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияНевыплаченнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НулеваяСумма</Name>
					<Comment>(Общ) ВР без расчета результата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДневнойТарифнойСтавке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойТарифнойСтавкеПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойТарифнойСтавкеПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавке</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоСреднегоЗаработка</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработку</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуДляОтпуска</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойТарифнойСтавкеУмножитьНаПроцент</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуФСС</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдельныйЗаработок</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходноеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуКомпенсацияОтпуска</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСреднемуЗаработкуВозвратОтпуска</Name>
					<Comment>(Регл)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяФормула</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоначислениеОтОбратного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндексацияАлиментов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаДоМЗП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыАлгоритмовРасчетНДФЛ17.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыАлгоритмовРасчетНДФЛ17</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоначислениеНаСуммуПревышения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельныйРасчетБазы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыАлгоритмовРасчетИндексацииПропорционально.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыАлгоритмовРасчетИндексацииПропорционально</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПрименять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляНеполногоРабочегоВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляВсехСотрудников</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыАлгоритмовПорогИндексации103.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантыАлгоритмовПорогИндексации103</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрименятьС01012016</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрименятьПоИндексуИнфляции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПроцедурыОбновленияИнформационнойБазыПереопределяемый/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ БСП

// Возвращает номер версии Библиотеки ЗУП (укр)
//
Функция ВерсияБиблиотеки()
	
	Возврат "2.1.46.2";
	
КонецФункции

// Возвращает список процедур-обработчиков обновления библиотеки
//
// Возвращаемое значение:
//   Структура - описание полей структуры см. в функции
//               ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления() 
Функция ОбработчикиОбновления()
	
	Обработчики = ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления();
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.20.3";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ПервыйЗапуск";
	
	ЭтоНеПериферияРИБ = Не ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел());
	
	// 2.1.25
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.25.3";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1317";
	Обработчик.Опциональный = Истина; 
	
	// 2.1.26
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.26.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1319";
	Обработчик.Опциональный = Истина; 

	// 2.1.28
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.28.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1321";
	Обработчик.Опциональный = Истина; 
	
	// 2.1.30
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.30.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1323";
	Обработчик.Опциональный = Истина;
	
	// 2.1.31
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.31.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1324";
	Обработчик.Опциональный = Истина;
	
	// 2.1.32
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.32.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1326";
	Обработчик.Опциональный = Истина;
	
	// 2.1.33
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.33.3";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1328";
	Обработчик.Опциональный = Истина;
	
	// 2.1.34
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.34.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1331";
	Обработчик.Опциональный = Истина;
	
	// 2.1.35
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.35.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1335";
	Обработчик.Опциональный = Истина;
	
	// 2.1.36
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.36.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1336";
	Обработчик.Опциональный = Истина;
	
	// 2.1.37
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.37.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1337";
	Обработчик.Опциональный = Истина;
	
	// 2.1.38
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.38.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1338";
	Обработчик.Опциональный = Истина;
	
	// 2.1.39
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.39.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1339";
	Обработчик.Опциональный = Истина;
	
	// 2.1.40
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.40.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1340";
	Обработчик.Опциональный = Истина;
	
	// 2.1.41
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.41.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1342";
	Обработчик.Опциональный = Истина;
	
	// 2.1.42
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.42.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1343";
	Обработчик.Опциональный = Истина;
	
	// 2.1.43
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.43.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1344";
	Обработчик.Опциональный = Истина;
	
	// 2.1.44
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.44.1";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1347";
	Обработчик.Опциональный = Истина;
	
	// 2.1.45
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.45.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1348";
	Обработчик.Опциональный = Истина;

	// 2.1.45
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.45.3";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1349";
	Обработчик.Опциональный = Истина;
	
	// 2.1.46
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия       = "2.1.46.2";
	Обработчик.Процедура    = "ПроцедурыОбновленияИнформационнойБазыПереопределяемый.ОбновлениеЗУП1354";
	Обработчик.Опциональный = Истина;
	
	
	Возврат Обработчики;
	
КонецФункции

Функция ПараметрыМакетаОписаниеОбновлений() Экспорт
	
	Параметры = Новый Структура;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		
	Параметры.Вставить("ВариантыАлгоритмов", РаботаСДиалогами.ВернутьФормуЕслиДоступна(Метаданные.РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты, РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты,, "ФормаСписка"));
		
	#КонецЕсли
	
	Возврат Параметры;
	
КонецФункции

// Неинтерактивное обновление данных ИБ при смене версии библиотеки
// Обязательная "точка входа" обновления ИБ в библиотеке.
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	ОбновлениеИнформационнойБазы.ВыполнитьИтерациюОбновления(
		"ЗУП (укр)",
		ВерсияБиблиотеки(),
		ОбработчикиОбновления());
		
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ

Процедура ПервыйЗапуск() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		// Первоначальное заполнение делаем только в главном узле.
		// Информация о версиях подсистем не мигрирует в составе РИБ
		Возврат;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	
	// Заполнение сведений по заработной плате и учету персонала
	УстановитьКонстанту("ОсновноеПредставлениеФизЛиц"             , Перечисления.ПредставленияФизЛиц.ФамилияИО);
	
	//Заполнить реквизиты предопределенных смен
	ПроцедурыОбновленияИнформационнойБазы.ЗаполнитьПредопределенныеСмены();
	
	// Включить генерацию всех видов задач
	ПроцедурыОбновленияИнформационнойБазы.УстановитьИспользованиеВидовЗадачПользователей();
	
	// Заполнить предопределенные настройки отчетов
	ПроцедурыОбновленияИнформационнойБазы.ЗагрузитьНастройкиОтчетов();
	
	ЗаполнитьСтажВДняхСтажВЧасах();
	
	ЗаполнитьНачисленияДляПредварительногоРасчета();
	
	ЗаполнитьВариантыАлгоритмов();
	
	
КонецПроцедуры

// Процедура устанавливает указанное значение указанной константы и выводит сообщение.
// Предназначена для вызова из процедур заполнения и обработки справочников информационной базы.
//
// Параметры:
//  ИмяКонстанты      - имя константы, которую требуется установить.
//  ЗначениеКонстанты - значение константы.
//
Процедура УстановитьКонстанту(ИмяКонстанты, ЗначениеКонстанты)

	Если Константы[ИмяКонстанты].Получить() = ЗначениеКонстанты Тогда
		Возврат;
	КонецЕсли;

	Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);

	СтрСообщения = "Константе """ + Метаданные.Константы[ИмяКонстанты].Синоним + """ "
	             + "назначено значение """ + ЗначениеКонстанты + """";

	ОбщегоНазначения.Сообщение(СтрСообщения, СтатусСообщения.Обычное);

КонецПроцедуры // УстановитьКонстанту

///////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗУП

Процедура ЗаполнитьСтажВДняхСтажВЧасах()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОсновныеНачисленияОрганизаций.Ссылка КАК ВидРасчета,
	               |	ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени
	               |ИЗ
	               |	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
				   |ГДЕ ОсновныеНачисленияОрганизаций.ЗачетОтработанногоВремени";
				   
	ТаблицаРабочеговремени = Запрос.Выполнить().Выгрузить();			   
	
	
	ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СтажВДнях.ПолучитьОбъект();
	
	ВР.КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
	ВР.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	ВР.ФормулаРасчета = "ИсходныеДанные.Показатель1";
	ВР.БазаПоНазначению = Истина;
	
	Показатель = ВР.Показатели.Добавить();
	Показатель.Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБазаВремяВДнях;
	
	ВР.БазовыеВидыРасчета.Очистить();
	ВР.БазовыеВидыРасчета.Загрузить(ТаблицаРабочеговремени);
	
	ВР.Записать();
	
	ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СтажВЧасах.ПолучитьОбъект();
	
	ВР.КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
	ВР.СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	ВР.ФормулаРасчета = "ИсходныеДанные.Показатель1";
	ВР.БазаПоНазначению = Истина;
	
	Показатель = ВР.Показатели.Добавить();
	Показатель.Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБазаВремяВЧасах;
	
	ВР.БазовыеВидыРасчета.Очистить();
	ВР.БазовыеВидыРасчета.Загрузить(ТаблицаРабочеговремени);
	
	ВР.Записать();

	
КонецПроцедуры

Процедура ЗаполнитьНачисленияДляПредварительногоРасчета()
	
	НаборЗаписей = РегистрыСведений.НачисленияДляПредварительногоРасчета.СоздатьНаборЗаписей(); 

	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаВечерниеЧасы; 

	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаНочныеЧасы; 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаСверхурочных;
	НоваяЗапись.ИспользоватьИзРегистров = Истина;
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПраздничныхИВыходных;
	НоваяЗапись.ИспользоватьИзРегистров = Истина;
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Замещение;
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	НоваяЗапись.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Совмещение; 
	
	НаборЗаписей.Записать();

	
КонецПроцедуры

Процедура ЗаполнитьВариантыАлгоритмов()
	
	НаборЗаписей = РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты.СоздатьНаборЗаписей(); 
	Запись = НаборЗаписей.Добавить();
	Запись.РасчетНДФЛ17 = Перечисления.ВариантыАлгоритмовРасчетНДФЛ17.ДоначислениеНаСуммуПревышения;
	Запись.РасчетИндексацииПропорционально = Перечисления.ВариантыАлгоритмовРасчетИндексацииПропорционально.НеПрименять;
	Запись.ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьС01012016;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ОбновлениеЗУП1317() Экспорт
	
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		//Ежемесячные обновления
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		//резерв отпусков
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ИспользованиеРезерваОтпусков.ПолучитьОбъект();
		СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.ОбеспечениеВыплатОтпусков;
		СпособОтражения.Записать();
		
		//отражение больничных
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетПредприятия.ПолучитьОбъект();
		СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
		СпособОтражения.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоДругимВыплатам;
		СпособОтражения.НалоговоеНазначениеДоходовИЗатрат = Справочники.НалоговыеНазначенияАктивовИЗатрат.НКУ_ХозДеятельность;
		СтатьяНД = Справочники.СтатьиНалоговыхДеклараций.НПНК_ИВ_Другие_;
		СтатьяЗатрат = Справочники.СтатьиЗатрат.НайтиПоРеквизиту("СтатьяДекларацииПоНалогуНаПрибыль",СтатьяНД);
		СпособОтражения.СубконтоДт1 = СтатьяЗатрат;
		СпособОтражения.Записать();
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетФСС.ПолучитьОбъект();
		СпособОтражения.СпособОтраженияЕСВФОТ = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетПредприятия;
		СпособОтражения.Записать();
		ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛОрганизации.ПолучитьОбъект();
		ВР.СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетПредприятия;
		ВР.Записать();
				
		//отражение займов
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеУдержанийПоЗаймам.ПолучитьОбъект();
		СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате;
		СпособОтражения.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСРабочимиИСлужащимиПоДругимОперациям;
		СпособОтражения.Записать();

	
КонецПроцедуры	

Процедура ОбновлениеЗУП1319() Экспорт
	
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		//Ежемесячные обновления
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета",  "СреднийЗаработок"); 
	
КонецПроцедуры	

Процедура ОбновлениеЗУП1321() Экспорт
	
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		//Ежемесячные обновления
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ШкалаПочтовыхСборов"); 
		
		//Бюджет
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "МинимальнаяОплатаТруда");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ПрожиточныеМинимумы");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "РазмерыЛьготНДФЛ");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтавкиНДФЛ");
		
		//Изменения по ЕСВ - судостроение
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "Налоги");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ВзносыВФондыПоГруппам");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ВидыРасчетовВзносовВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СведенияОВзносахВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ШкалаСтавокНалогов");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СводОтчисленийВФондыНастройкиОтчета");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ОтражениеВзносовВРеглУчете");
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1323() Экспорт
	
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		//Ежемесячные обновления
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		//Изменения по ЕСВ - декретные
		НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета",  "ВзносыВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "Налоги");
		НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ВидыРасчетовВзносовВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СведенияОВзносахВФонды");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ШкалаСтавокНалогов");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СводОтчисленийВФондыНастройкиОтчета");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ОтражениеВзносовВРеглУчете");
		
		СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеДекретныхЗаСчетФСС.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(СпособОтражения, Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеБольничныхЗаСчетФСС,,"Код, Наименование, Владелец");
		СпособОтражения.СубконтоДт1 = Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Берем;
		СпособОтражения.Записать();
		ВР = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам.ПолучитьОбъект();
		ВР.СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеДекретныхЗаСчетФСС;
		ВР.Записать();

		
КонецПроцедуры	

Процедура ОбновлениеЗУП1324() Экспорт
	
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		//Ежемесячные обновления
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1326() Экспорт
	
		НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
		//Ежемесячные обновления
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
		
		//Обновления по НДФЛ с начала года
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "РазмерыЛьготНДФЛ");
		НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СтавкиНДФЛ");

		ЧернобыльскийОтпуск = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ЧернобыльскийОтпуск;
		ВР_ЕСВ = ПланыВидовРасчета.ВзносыВФонды.ЕСВ.ПолучитьОбъект();
		Если ВР_ЕСВ.БазовыеВидыРасчета.Найти(ЧернобыльскийОтпуск) = Неопределено Тогда
			НоваяСтрока = ВР_ЕСВ.БазовыеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ЧернобыльскийОтпуск;
			ВР_ЕСВ.Записать();
		КонецЕсли;
		
        ВР_ЕСВФОТ = ПланыВидовРасчета.ВзносыВФонды.ЕСВФОТ.ПолучитьОбъект();
		Если ВР_ЕСВФОТ.БазовыеВидыРасчета.Найти(ЧернобыльскийОтпуск) = Неопределено Тогда
			НоваяСтрока = ВР_ЕСВФОТ.БазовыеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ЧернобыльскийОтпуск;
			ВР_ЕСВФОТ.Записать();
		КонецЕсли;
		
		ПростойПоСредней = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойПоСредней;
		Простой = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Простой;
        ОплатаПоЧасовомуТарифу = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой.ПолучитьОбъект();
		
		Если ОплатаПоЧасовомуТарифу.ВытесняющиеВидыРасчета.Найти(Простой) = Неопределено Тогда
			НоваяСтрока = ОплатаПоЧасовомуТарифу.ВытесняющиеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = Простой;
			ОплатаПоЧасовомуТарифу.Записать();
		КонецЕсли;	
		
		Если ОплатаПоЧасовомуТарифу.ВытесняющиеВидыРасчета.Найти(ПростойПоСредней) = Неопределено Тогда
			НоваяСтрока = ОплатаПоЧасовомуТарифу.ВытесняющиеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ПростойПоСредней;
			ОплатаПоЧасовомуТарифу.Записать();
		КонецЕсли;
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1328() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1331() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
	
	//Военный сбор
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ВидыДоходовНДФЛ");
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "Налоги");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СтавкиНДФЛ");
		
	СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеВоенногоСбора.ПолучитьОбъект();
	СпособОтражения.Наименование = НСтр("ru='Отражение военного сбора';uk='Відображення выйськового збору'",Локализация.КодЯзыкаИнформационнойБазы());
	СпособОтражения.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоОбязательнымПлатежам;
	СпособОтражения.СубконтоКт1 = Справочники.Налоги.ВоенныйСбор;
	СпособОтражения.Записать();
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1335() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");
		
	//Реформа ЕСВ
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СведенияОВзносахВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ШкалаСтавокНалогов");
		
	//Реформа НДФЛ
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СтавкиНДФЛ");
		
	//Реформа больничных
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ШкалаВыслугиЛет");
		
	//Бюджет
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ПрожиточныеМинимумы");
	
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ПричиныНетрудоспособности");
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1336() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");

	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "РазмерыЗаконодательноУстановленныхВыплат");
	
	ОтражениеВС = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеВоенногоСбора.ПолучитьОбъект();
	ОтражениеВС.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате;
	ОтражениеВС.Записать();
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1337() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");

	// Новый праздник - День защитника Украины
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ВидыПраздников");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "Праздники");
	
	НаборЗаписей = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДатаКалендаря.Установить(Дата(2015,10,13));
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
   		Запись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный;
		НаборЗаписей.Записать();	
	КонецЕсли;	
	
	НаборЗаписей.Отбор.ДатаКалендаря.Установить(Дата(2015,10,14));
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
		Запись.Пятидневка = 0;
		Запись.Шестидневка = 0;
		Запись.КалендарныеДни = 0;
   		Запись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник;
		НаборЗаписей.Записать();	
	КонецЕсли	
		
КонецПроцедуры	

Процедура ОбновлениеЗУП1338() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СредняяЗППоВсемВидамЭкономическойДеятельности");

	//Оплата мобилизованным
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета", "ОсновныеНачисленияОрганизаций");
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета", "ВзносыВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "Налоги");
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "СтатьиНалоговыхДеклараций");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ВидыРасчетовВзносовВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СведенияОВзносахВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ШкалаСтавокНалогов");
	
КонецПроцедуры	

Процедура ОбновлениеЗУП1339() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	
	СпособОтражения = Справочники.СпособыОтраженияЗарплатыВРеглУчете.ОтражениеЗарплатыМобилизованных.ПолучитьОбъект();
	СпособОтражения.Наименование = НСтр("ru='Отражение зарплаты мобилизованных';uk='Відображення зарплати мобілізованих'",Локализация.КодЯзыкаИнформационнойБазы());
	СпособОтражения.СчетДт = ПланыСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельности;
	СпособОтражения.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыПоДругимВыплатам;
	СпособОтражения.СубконтоКт1 = "";
	СпособОтражения.Записать();
	
КонецПроцедуры	

Процедура ОбновлениеЗУП1340() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	
	//Оплата по среднему для больничных
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "КлассификаторИспользованияРабочегоВремени");
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник", "ПричиныНетрудоспособности");
	ЗаполнитьНепредопределенныеБазовыеПоЗаработкуБЛФСС();
		
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета", "СреднийЗаработок");
		
	ЗаполнитьСтажВДняхСтажВЧасах();
	
КонецПроцедуры

Процедура ЗаполнитьНепредопределенныеБазовыеПоЗаработкуБЛФСС()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СреднийЗаработокБазовыеВидыРасчета.ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК СреднийЗаработокБазовыеВидыРасчета
	|ГДЕ
	|	СреднийЗаработокБазовыеВидыРасчета.ВидРасчета.Предопределенный = ЛОЖЬ
	|	И СреднийЗаработокБазовыеВидыРасчета.Ссылка В (ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛБерИРоды), 
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛ), 
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛПропорционально))";
	
	ТаблицаБазовыхВидовРасчета = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаБазовыхВидовРасчета.Количество() > 0 Тогда
		НовыйПоЗаработкуБЛФСС = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуБЛФСС.ПолучитьОбъект();
		НовыйПоЗаработкуБЛФСС.БазовыеВидыРасчета.Загрузить(ТаблицаБазовыхВидовРасчета);
		НовыйПоЗаработкуБЛФСС.Записать()
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеЗУП1342() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
	
	//Бюджет
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ПрожиточныеМинимумы");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "СведенияОВзносахВФонды");
	
КонецПроцедуры

Процедура ОбновлениеЗУП1343() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		
	//Реформа ЕСВ
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СведенияОВзносахВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ШкалаСтавокНалогов");
		
	//Реформа НДФЛ
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СтавкиНДФЛ");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "РазмерыЛьготНДФЛ");
		
	//Бюджет
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ПрожиточныеМинимумы");
		
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "КатегорииДолжностей");
КонецПроцедуры

Процедура ДополнитьБазуПоЗаработкуДляОтпуска()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СреднийЗаработокБазовыеВидыРасчета.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.СреднийЗаработок.БазовыеВидыРасчета КАК СреднийЗаработокБазовыеВидыРасчета
	|ГДЕ
	|	СреднийЗаработокБазовыеВидыРасчета.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска)";
	
	ТаблицаБазовыхВидовРасчета = Запрос.Выполнить().Выгрузить();
	НайденнаяСтрока = ТаблицаБазовыхВидовРасчета.Найти(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю,"ВидРасчета");
	Если НайденнаяСтрока = Неопределено Тогда
		ПоЗаработкуДляОтпуска = ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска.ПолучитьОбъект();
		НовыйБазовыйВидРасчета = ПоЗаработкуДляОтпуска.БазовыеВидыРасчета.Добавить();
		НовыйБазовыйВидРасчета.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю;
		Попытка
			ПоЗаработкуДляОтпуска.Записать();
		Исключение
			Сообщить("Не удалось обновить базовые виды расчета для "+ПланыВидовРасчета.СреднийЗаработок.ПоЗаработкуДляОтпуска);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры// Процедура выполняет начальное заполнение констант


Процедура ОбновлениеЗУП1344() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");

	ДополнитьБазуПоЗаработкуДляОтпуска();
		
	//новый вариант алгоритмов
	НаборЗаписей = РегистрыСведений.ВариантыАлгоритмовРасчетаЗарплаты.СоздатьНаборЗаписей(); 
    НаборЗаписей.Прочитать();
	Для Каждого Запись из НаборЗаписей Цикл
		Запись.ПорогИндексации103 = Перечисления.ВариантыАлгоритмовПорогИндексации103.ПрименятьС01012016;
	КонецЦикла;	
	НаборЗаписей.Записать();
	
КонецПроцедуры


Процедура ЗаполнитьОплатаПоСреднемуМобОрганизации()
	
	ОплатаПосреднемуМобОрганизации = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПосреднемуМобОрганизации.ПолучитьОбъект();
	
	ОплатаПосреднемуМобОрганизации.КатегорияРасчета 						= Перечисления.КатегорииРасчетов.Первичное;
	ОплатаПосреднемуМобОрганизации.СпособРасчета							= Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработку;
	ОплатаПосреднемуМобОрганизации.ОбозначениеВТабелеУчетаРабочегоВремени	= Справочники.КлассификаторИспользованияРабочегоВремени.НеотработанноеВремяПоЗаконодательству;
	ОплатаПосреднемуМобОрганизации.ВидВремени								= Перечисления.ВидыВремени.ЦелодневноеНеотработанное;
	ОплатаПосреднемуМобОрганизации.ЗачетОтработанногоВремени				= Ложь;
	ОплатаПосреднемуМобОрганизации.ЗачетНормыВремени						= Истина;
	ОплатаПосреднемуМобОрганизации.ЗачетКалендарных							= Истина;
	ОплатаПосреднемуМобОрганизации.ДоходНДФЛ								= Справочники.ВидыДоходовНДФЛ.Код01;
	ОплатаПосреднемуМобОрганизации.СчетУчета								= ПланыСчетов.Хозрасчетный.РасчетыПоЗаработнойПлате;
	ОплатаПосреднемуМобОрганизации.ЭтоЗарплатаМобилизованным				= Истина;
	ОплатаПосреднемуМобОрганизации.ПоказателиВидовОплатыТруда				= Справочники.СтатьиНалоговыхДеклараций.ОтчетПоТруду_ФОТ;
	ОплатаПосреднемуМобОрганизации.Записать();
	
	ЕСВМобилизованные = ПланыВидовРасчета.ВзносыВФонды.ЕСВМобилизованные.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзносыВФондыБазовыеВидыРасчета.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.ВзносыВФонды.БазовыеВидыРасчета КАК ВзносыВФондыБазовыеВидыРасчета
	|ГДЕ
	|	ВзносыВФондыБазовыеВидыРасчета.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ВзносыВФонды.ЕСВМобилизованные)";
	
	ТаблицаБазовыхВидовРасчета = Запрос.Выполнить().Выгрузить();
	
	НайденнаяСтрока = ТаблицаБазовыхВидовРасчета.Найти(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПосреднемуМобОрганизации,"ВидРасчета");
	Если НайденнаяСтрока = Неопределено Тогда
		
		НовыйБазовыйВидРасчета = ЕСВМобилизованные.БазовыеВидыРасчета.Добавить();
		НовыйБазовыйВидРасчета.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПосреднемуМобОрганизации;
		Попытка
			ЕСВМобилизованные.Записать();
		Исключение
			Сообщить("Не удалось обновить базовые виды расчета для "+ПланыВидовРасчета.ВзносыВФонды.ЕСВМобилизованные);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЕСВФОТМобилизованные()
	
	ЕСВФОТМобилизованные = ПланыВидовРасчета.ВзносыВФонды.ЕСВФОТМобилизованные.ПолучитьОбъект();
	ЕСВФОТМобилизованные.Наименование = НСтр("ru='ЕСВ ФОТ (мобилизованные)';uk='ЄСВ ФОП (мобілізовані)'",Локализация.КодЯзыкаИнформационнойБазы());	
	ЕСВФОТМобилизованные.СпособРасчета				= Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ;
	ЕСВФОТМобилизованные.ЕСВ						= Истина;
	ЕСВФОТМобилизованные.КатегорияРасчета   		= Перечисления.КатегорииРасчетов.Первичное;
	ЕСВФОТМобилизованные.СпособРасчетаПоШкале   	= Перечисления.СпособыРасчетаПоШкале.ПоШкале;
	ЕСВФОТМобилизованные.СтавкаПоПериодуРегистрации	= Истина;
	ЕСВФОТМобилизованные.Актуальность				= Истина;
	
	БазаЕСВМобилизованные = ПланыВидовРасчета.ВзносыВФонды.ЕСВМобилизованные.БазовыеВидыРасчета.Выгрузить();
	ЕСВФОТМобилизованные.БазовыеВидыРасчета.Загрузить(БазаЕСВМобилизованные);
	
	ВедущиеЕСВМобилизованные = ПланыВидовРасчета.ВзносыВФонды.ЕСВМобилизованные.ВедущиеВидыРасчета.Выгрузить();
	ЕСВФОТМобилизованные.ВедущиеВидыРасчета.Загрузить(ВедущиеЕСВМобилизованные);
	
	Попытка
		ЕСВФОТМобилизованные.Записать();
	Исключение
		Сообщить("Не удалось обновить базовые виды расчета для "+ПланыВидовРасчета.ВзносыВФонды.ЕСВФОТМобилизованные);
	КонецПопытки;

	
КонецПроцедуры

Процедура ОбновлениеЗУП1347() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
		
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");
		
	//Бюджет
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ПрожиточныеМинимумы");
	//
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений", "ШкалаПочтовыхСборов");
	//Отчет по ЕСВ
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "Налоги");
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "СтатьиНалоговыхДеклараций");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ВзносыВФондыПоГруппам");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ВидыРасчетовВзносовВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ОтражениеВзносовВРеглУчете");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СведенияОВзносахВФонды");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ШкалаСтавокНалогов");
	
	ЗаполнитьОплатаПоСреднемуМобОрганизации();
	ЗаполнитьЕСВФОТМобилизованные();
	
КонецПроцедуры


Процедура ДобавитьВытесняющийОплатаПоСреднемуМобОрганизации()
	
	Запрос = Новый Запрос;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТУжеДобавленныеВВытесняющие
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
	|ГДЕ
	|	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуМобОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
	|ГДЕ
	|	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуМоб)
	|	И НЕ ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТУжеДобавленныеВВытесняющие.Ссылка
	|				ИЗ
	|					ВТУжеДобавленныеВВытесняющие КАК ВТУжеДобавленныеВВытесняющие)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ВидРасчета = Выборка.Ссылка.ПолучитьОбъект();
		НовыйВытесняющийВидРасчета = ВидРасчета.ВытесняющиеВидыРасчета.Добавить();
		НовыйВытесняющийВидРасчета.ВидРасчета = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПосреднемуМобОрганизации;
		Попытка
			ВидРасчета.Записать();
		Исключение
			Сообщить("Не удалось обновить вытесняющие виды расчета для " + Выборка.Ссылка);
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновлениеЗУП1348() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
	
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");

	//Бюджет
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ПрожиточныеМинимумы");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "РазмерыЛьготНДФЛ");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СведенияОВзносахВФонды");
	
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ДополнительныеГарантииВСодействииТрудоустройству");
	
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СводОтчисленийВФондыНастройкиОтчета");
	
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета",  "УдержанияОрганизаций");
	
	ДобавитьВытесняющийОплатаПоСреднемуМобОрганизации();
	
КонецПроцедуры

Процедура ОбновлениеЗУП1349() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
	
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");

	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьПланВидовРасчета("ОсновныеНачисленияОрганизаций", Истина, "ДоплатаДоМЗП");
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета",  "УдержанияОрганизаций", Истина);
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета",  "СреднийЗаработок", Истина);
	НачальноеЗаполнение.ЗаполнитьОбъект("ПланВидовРасчета",  "ВзносыВФонды", Истина);
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ПоказателиСхемМотивации");
	
КонецПроцедуры


Процедура ИзменитьЗаписиПроизводственногоКалендаря2017()
	
	НаборЗаписей = РегистрыСведений.РегламентированныйПроизводственныйКалендарь.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДатаКалендаря.Установить(Дата(2017,12,25));
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
		Запись.Пятидневка = 0;
		Запись.Шестидневка = 0;
		Запись.КалендарныеДни = 0;
   		Запись.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник;
		НаборЗаписей.Записать();	
	КонецЕсли	

КонецПроцедуры

Процедура ОбновлениеЗУП1354() Экспорт
	
	НачальноеЗаполнение = Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.Создать();
	
	//Ежемесячные обновления
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ИндексИнфляции");

	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ВидыОтпусков");

	//Праздники
	НачальноеЗаполнение.ЗаполнитьОбъект("Справочник",  "ВидыПраздников");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "Праздники");
	ИзменитьЗаписиПроизводственногоКалендаря2017();
		
	//Бюджет
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "МинимальнаяОплатаТруда");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "ПрожиточныеМинимумы");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "РазмерыЛьготНДФЛ");
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "СведенияОВзносахВФонды");
		
	//Пособие на погребение
	НачальноеЗаполнение.ЗаполнитьОбъект("РегистрСведений",  "РазмерыЗаконодательноУстановленныхВыплат");
	
КонецПроцедуры
